Everything on Ruby is an object.

Ruby, an OOP and functional programming language with a clean sintax,
has the following elements:

* Methods

  The following function creates a method which can take a parameter,
  its default value being World. 
  
  #+BEGIN_SRC ruby

  def hi(name = "World") 
  puts "Hello #{name.capitalize}!"
  end
  
  #+END_SRC

  #+RESULTS:
  : Hello World!

  #{x} converts x into a string if it isn't one already, then it
  #substitutes the outer string at that point.

  Methods bundle actions that an object can take. A method without
  parameters can be called by its name without parentheses.

  def method_name(var1, var2)

  Calling this method by: method_name 23, 30

  Calling a method with parameters without default values will give us
  error. By default, methods return a value. This value being the
  value of the last statement.

  #+BEGIN_SRC ruby

    def test
      i = 1
      w = 2
      r = 0
    end

  #+END_SRC

  #+RESULTS:
  : 0

  We could also use return to specify the returned value.

  If more than two expressions are given, the returned value will be
  an array of those values. If no expression given, nil will be
  returned.

  #+BEGIN_SRC ruby

     def sample (*test)
       puts "The number of parameters is #{test.length}"
       for i in 0 ...test.length
	 puts "The parameters are #{test[i]}"
       end
     end
     sample "Zara", "6", "F"
     sample "Mac", "36", "M", "MCA"

  #+END_SRC

  #+RESULTS:
  : The number of parameters is 3
  : The parameters are Zara
  : The parameters are 6
  : The parameters are F
  : The number of parameters is 4
  : The parameters are Mac
  : The parameters are 36
  : The parameters are M
  : The parameters are MCA

  To see what methods a class responds to:

  #+BEGIN_SRC ruby

  greeter.respond_to?("name")
  => false 
  There's no 'name' method

  greeter.respond_to?("say_hi")
  => true
  There is a 'say_hi' method

  greeter.respond_to?("to_s")
  => true
  to_s method is also existent
  
  #+END_SRC

  say_hi and to_s convert something to a string, they are default in
  every object.

  To access object variables, we should call the class:

  #+BEGIN_SRC ruby

    class Greeter
      attr_accessor :name
    end

    greeter = Greeter.new("Someone")
    => #<Greeter"0x3c9b0 @name="Andy">

    greeter.respond_to?("name")
    => true

    greeter.respond_to?("name=")
    => Someone

    greeter.say_hin
    Hi Someone!
    => nil

  #+END_SRC
  
  attr_accessor defines two new methods, name to get the value and
  name= to see it.

  Methods are usually attached to the end of variables and constants
  by a dot, like front_door.open, being open the method. Methods can
  also be chained together, like so: front_door.open.is_open?.close

  Some methods may require more information in order to perform its
  action, this arguments are attached to the end of a method. 
  
  front_door.paint( :red )

  Methods with arguments can also be chained:

  front_door.paint ( 3, :red ).dry( 30 ).close()

  Some methods (print) are kernel methods, these are used throughout
  Ruby. Since they are so common, you won't use a dot.

  print "No dot"

  Greeter.instance_methods gives us a list of methods we defined plus
  ancestor methods.
  
* Iterator
  Method which accepts a block or a Proc object, used to produce
  user-defined control structures -- especially loops.

  #+BEGIN_SRC ruby

    data = [1, 2, 3]
    data.each do |i|
      puts i
    end

  #+END_SRC

  #+RESULTS:
  | 1 | 2 | 3 |

  The each method of the array data is passed the do .. end block, and
  executes it repeatedly. On each call, the block is passed successive
  elements of the array.

* Arrays

  Data structure representing a list of values called
  elements. Multiple data that can be referenced under a single
  name. Arrays are objects with their own methods.

  #+BEGIN_SRC ruby

    # Instead of:

    email1 = "ceo@example.com"
    email2 = "admin@example.com"
    email3 = "support@example.com"
    email4 = "sales@example.com"

    # Use this:

    emails = [
      "ceo@example.com",
      "admin@example.com",
      "support@example.com",
      "sales@example.com"
    ]
    
    print emails

  #+END_SRC

  #+RESULTS:
  : list of emails

  There are two sintaxes when creating arrays:

  #+BEGIN_SRC ruby

    days = %w{Monday Tuesday Wednesday Thursday Friday Saturday Sunday}

    # OR

    days =  ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]

  #+END_SRC
  
  The length method helps us find out how many elements an array has,
  if we use days.length, it'll return 7. To find out the index of an
  element, use index. Using days.index("Thursday") returns 3. If
  there's no such element, a nil will be returned.

  To get the last element, we use days[-1]. It'll return sunday. We
  could use methods for this, first and last.

  Uninitialized array return nil. We add values with the push
  method. Or another syntax as days << "Something". To add something
  to the beginning, we use the unshift() method.

  To delete something, using the method delete_at will need an index,
  or just delete() and a value. Delete removes all elements containing
  the value specified.

  There are two ways of iterating through arrays. Here we say: for
  each element in the sharks array, add the value to the local
  variable shark and execute the following code:

  #+BEGIN_SRC ruby

    sharks = ["Hammerhead", "Great White", "Tiger", "Whale"]
    for shark in sharks do
      puts shark
    end

  #+END_SRC

  #+RESULTS:
  | Hammerhead | Great White | Tiger | Whale |

  Another way is using a method:
  
  #+BEGIN_SRC ruby

    sharks = ["Hammerhead", "Great White", "Tiger", "Whale"]
    sharks.each do |shark| 
      puts shark
    end

    #For a short syntax:

    sharks.each {|shark| puts shark }

  #+END_SRC

  #+RESULTS:
  | Hammerhead | Great White | Tiger | Whale |

* Hashes
  
  Collection of key-value pairs. Indexing is done via arbitrary keys
  of any object type, not an integer index as an arrat. One can
  traverse a hash by either key or value. Attempting to access an
  inexistnet key hash return nil. There are several ways of hash
  creation:

  #+BEGIN_SRC ruby

  {'a' => 'something', 'b' => 'bee', "red" => 0xf00}

  months = Hash.new

  months = Hash.new( "month" )
  #Or
  months = Hash.new "month"

  puts "#{months[0]}"
  puts "#{months[72]}"

  #+END_SRC

  #+RESULTS:
  : month | month

  One can use any object as a key or value, even an array.

  [1, "jan"] => "January"

** Character Classes

   Lets you define a range or a list of characters to match. For
   example, [aeiou] matches any vowel:

   #+BEGIN_SRC ruby

     def contains_vowel(str)
       str =~ /[aeiou]/
     end
     contains_vowel("test") # returns 1
     contains_vowel("sky")  # returns nil

   #+END_SRC

   Or use ranges to specify something:

   - [0-9] specifies all numbers from 0 to 9
   - [a-z] specifies all letters
   - [^a-z] Negated range

   In this example, we'll see if the string is a IP address, using !!
   to convert the value returned into a boolean:

   #+BEGIN_SRC ruby

     def ip_address?(str)
       # We use !! to convert the return value to a boolean
       !!(str =~ /^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$/)
     end
     ip_address?("192.168.1.1")  # returns true
     ip_address?("0000.0000")    # returns false

   #+END_SRC

   #+RESULTS:
   : false | true

** Instance Methods vs Class Methods

   For example, if we create a string, we'll be able to put any
   instance methods from the String class in the documentation. If we
   want to put any class methods, we'll have to call it by its class,
   for example:

   #+BEGIN_SRC ruby

   # instance method
   "This word will be split in an array".split
  
   #+END_SRC

   #+RESULTS:
   | This | word | will | be | split | in | an | array |

   #+BEGIN_SRC ruby

   # class method
   String.new("blue") # new will receive the "blue"

   #+END_SRC

   Any class is a subclass, with class instances, class methods and
   even Methods included.

** Type Conversion

   #+BEGIN_SRC ruby 

   '4'.to_f
  
   #+END_SRC

   #+RESULTS:
   : 4.0

   #+BEGIN_SRC ruby 

   "12".to_i
  
   #+END_SRC

   #+RESULTS:
   : 12

   #+BEGIN_SRC ruby
  
   12.to_s
  
   #+END_SRC

   #+RESULTS:
   : 12

** Arrays

   To eliminate the last element of an array:

   #+BEGIN_SRC ruby :session arraymod

   something = [1,2,3,4,5]
   something.pop
   something
  
   #+END_SRC

   #+RESULTS:
   | 1 | 2 | 3 | 4 |

   To add something at the end, use .push or << to mutate the caller.
  
   The .map method iterates over an array applying a block to each
   element of the array and returns a new array with those results. The
   irb session below shows how to use map to get the square of all
   numbers in an array. The .collect method is an alias to map - they do
   the same thing.

   To delete something in a position, use .delete_at(index). By value,
   use .delete()

   .uniq method iterates through an array and eliminates duplicate
   values.

   using ! suffix like .uniq! makes the process destructively, and
   changes the value of the array.

   .select is similar to .each, but it iterates and runs a code,
   returning a new array with the values that return true.

   Common methods for an array class are:

   .include? checks if a value exists in an array

   .flatten create a one-dimentional array from an array with nested
   arrays.

   .each_index iterates and returns index instead of the values inside
   those indexes.

   .each_with_index gives us the ability to manipulate both the value
   and the index by passing in two parameters to the block of code. The
   first is the value and the second is the index. You can then use
   them in the block.

   .sort orders an array, where 1 , 3, 2. Using sort will make the
   array 1, 2, 3.

   .product combines two arrays in an interesting way:

   #+BEGIN_SRC ruby

   [1, 2, 3].product([4, 5])
  
   #+END_SRC

   #+RESULTS:
   | 1 | 4 |
   | 1 | 5 |
   | 2 | 4 |
   | 2 | 5 |
   | 3 | 4 |
   | 3 | 5 |
  
** Regexp

   Used to match a sequence of characters.

   Here we use =~ operator to check for a match.

   #+BEGIN_SRC ruby

   "powerball" =~ /b/
  
   #+END_SRC

   #+RESULTS:
   : 5

** Exercises  

   1. Use the each method of Array to iterate over [1...10], and print out each value.

   #+BEGIN_SRC ruby

     one_to_ten = [1,2,3,4,5,6,7,9,10]

     one_to_ten.each do |number| puts number  end

   #+END_SRC   

   #+RESULTS:
   | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 9 | 10 |
   
   2. Same of above, but only printing out values greater than 5.

   #+BEGIN_SRC ruby :results output 

     one_to_ten = [1,2,3,4,5,6,7,9,10]
     one_to_ten.each {|number| puts number if number > 4 }

   #+END_SRC      

   #+RESULTS:
   : 5
   : 6
   : 7
   : 9
   : 10
   
   3. With the same array, use select to extract odd numbers into a new array
      
   #+BEGIN_SRC ruby 

     one_to_ten = [1,2,3,4,5,6,7,9,10]

     one_to_ten.select { |number| number % 2 == 1 }

   #+END_SRC   

   #+RESULTS:
   | 1 | 3 | 5 | 7 | 9 |

   4. Append 11 to the end of the original array, and 0 to the beginning

   #+BEGIN_SRC ruby

     one_to_ten = [1,2,3,4,5,6,7,9,10]

     one_to_ten.push(11)

     one_to_ten.unshift(0)

   #+END_SRC

   #+RESULTS:
   | 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 9 | 10 | 11 |

   5. With a hash, remove all key-value pairs whose value is less than 3.5

   #+BEGIN_SRC ruby

     h = { a:1, b:2, c:3, d:4 }

     h.delete_if { |k, v| v < 3.5 }

   #+END_SRC
   
   6. Write a program that display the current time.

      For this, we use the Time class

   #+BEGIN_SRC ruby

     time = Time.new

   #+END_SRC

   #+RESULTS:
   : 2020-02-20 14:36:25 -0500

